{
  "backend/main.mo": "Motoko actor defining Law and Preamble types with CRUD operations for managing up to 99 laws, including add, get, list, initialize, and clear functions with validation.",
  "feature_evidence.json": "Feature evidence report documenting the addition of 'devansh shukla 6B AF PANCHWATI' text to the LawsPage with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, hooks, and configuration for the Indian Constitution laws application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for burgundy/gold legal theme.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the React application titled 'law of india'.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for laws list, law detail, and preamble pages, plus LawInitializer component.",
  "frontend/src/components/LawDetail.tsx": "Component displaying full law details including number, title, and formatted explanation text with loading and error states.",
  "frontend/src/components/LawInitializer.tsx": "Component that automatically initializes laws on first load by checking if laws exist and triggering initialization with loading indicator.",
  "frontend/src/components/LawList.tsx": "Main list component integrating search, displaying filtered law count, and rendering scrollable list of LawListItem components.",
  "frontend/src/components/LawListItem.tsx": "Card component for individual law displaying number badge, title, and truncated explanation with click navigation to detail view.",
  "frontend/src/components/LawSearch.tsx": "Search input component with search icon and clear button for filtering laws by title or number.",
  "frontend/src/components/Layout.tsx": "Layout wrapper with burgundy/gold themed header containing branding and Preamble button, main content outlet, and footer with attribution.",
  "frontend/src/components/PreambleDisplay.tsx": "Component fetching and displaying the Preamble in a prominent card with burgundy/gold styling, including loading and error states.",
  "frontend/src/data/initialLaws.ts": "Exports an array of 99 Indian Constitution laws, each containing a title, number (bigint), and detailed explanation covering fundamental rights, state policies, and constitutional provisions.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor with Internet Identity authentication, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInitializeLaws.ts": "React mutation hook that initializes the backend with the predefined laws from initialLaws.ts and invalidates the laws query on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality with AuthClient integration, including identity persistence and status management.",
  "frontend/src/hooks/useLawFilter.ts": "React hook that filters an array of laws based on a search term, matching against title, number, or explanation fields.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all laws, individual laws by number, and getting/setting the preamble from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color variables for light/dark themes, including burgundy and gold accent colors for a legal-themed design with serif fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/pages/LawDetailPage.tsx": "Page component that displays detailed information for a single law identified by URL parameter, with a back button to return to the laws list.",
  "frontend/src/pages/LawsPage.tsx": "Main page displaying the list of all Indian laws with a header, description, and student attribution text.",
  "frontend/src/pages/PreamblePage.tsx": "Page component that displays the Indian Constitution's preamble with decorative styling and explanatory text about its significance.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom colors (burgundy, gold), OKLCH color system, container settings, and typography/animation plugins.",
  "project_state.json": "Project state tracking file documenting an Indian Constitution app with 99 articles and preamble, including existing features (browsable list, detailed views, search, legal-themed UI) and architectural notes about data structure and component organization."
}