{
  "backend/main.mo": "Motoko actor defining Law and Preamble types with functions to add/retrieve laws (max 51), set/get preamble, initialize laws from array, and clear data.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of backend data structure for storing 50 laws with high confidence, linking frontend files and test IDs.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend TypeScript/React components, hooks, pages, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining burgundy/gold palette and sidebar styling.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the 'law of india' application.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for laws list, law detail, and preamble pages, wrapped with LawInitializer component.",
  "frontend/src/components/LawDetail.tsx": "Component displaying full law details including number badge, title, and formatted explanation text with loading and error states.",
  "frontend/src/components/LawInitializer.tsx": "Component that automatically initializes 50 laws on first app load by checking if laws exist and triggering backend initialization with loading indicator.",
  "frontend/src/components/LawList.tsx": "Main list component integrating search functionality, displaying filtered law count, and rendering scrollable grid of LawListItem cards with loading states.",
  "frontend/src/components/LawListItem.tsx": "Clickable card component displaying law number badge, title, and truncated explanation preview with hover effects and navigation to detail page.",
  "frontend/src/components/LawSearch.tsx": "Search input component with search icon and clear button for filtering laws by title or number.",
  "frontend/src/components/Layout.tsx": "Root layout component with burgundy/gold themed header containing logo and Preamble button, main content outlet, and footer with attribution.",
  "frontend/src/components/PreambleDisplay.tsx": "Component fetching and displaying the Constitution Preamble in a prominent card with scroll icon, title, and formatted explanation text.",
  "frontend/src/data/initialLaws.ts": "Exports an array of 50 Indian Constitution laws, each containing a title, number (bigint), and detailed explanation covering fundamental rights and constitutional provisions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInitializeLaws.ts": "Provides a mutation hook to initialize laws in the backend by calling the actor's initializeLaws method with data from initialLaws, then invalidates the laws query cache.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication with React context, providing login/logout functionality, identity management, and status tracking using the DFINITY AuthClient.",
  "frontend/src/hooks/useLawFilter.ts": "Custom hook that filters an array of laws based on a search term, matching against title, number, or explanation fields with memoization for performance.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all laws, individual laws by number, and preamble data, plus a mutation hook for setting the preamble with cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color variables for light/dark themes, legal-themed burgundy and gold colors, and a background overlay utility for legal aesthetics.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/LawDetailPage.tsx": "Page component that displays detailed information for a specific law using the number from URL params, with a back button to return to the laws list.",
  "frontend/src/pages/LawsPage.tsx": "Main page component that displays a header and the LawList component, presenting the Indian Legal Compendium with 50 fundamental laws.",
  "frontend/src/pages/PreamblePage.tsx": "Page component that displays the Indian Constitution's preamble with a back button, title, description, and explanatory note about its significance.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom colors (burgundy, gold), OKLCH color system, container settings, and plugin integrations for typography, animations, and container queries.",
  "project_state.json": "Project state tracking file documenting an Indian Constitution app with 51 laws and preamble display features. Contains existing features, pending feature requests, and architectural notes about backend data structures and frontend implementation."
}