{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add 50 laws of Indian Constitution with complete explanations",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Populate the application with 50 comprehensive Indian Constitution laws including complete explanations",
      "acceptanceCriteria": [
        "All 50 laws display in the law list with their numbers and titles",
        "Each law detail page shows the complete explanation when clicked",
        "Search functionality works across all 50 laws",
        "The existing 51st law (Preamble) remains intact and functional",
        "Burgundy and gold legal theme styling is preserved throughout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/initialLaws.ts",
          "operation": "create",
          "description": "Create a data file containing all 50 Indian Constitution laws with their numbers, titles, and complete explanations. Structure as an array of tuples matching the backend initializeLaws parameter format: [title: string, number: bigint, explanation: string][]. Ensure law numbers are unique and sequential. Include comprehensive explanations for each law covering its purpose, scope, and significance in the Indian Constitution."
        },
        {
          "path": "frontend/src/hooks/useInitializeLaws.ts",
          "operation": "create",
          "description": "Create a custom hook that uses React Query's useMutation to call the backend initializeLaws method with the data from initialLaws.ts. This hook should handle loading states, error handling, and success callbacks. Import the initialLaws data and convert number values to BigInt before sending to the backend."
        },
        {
          "path": "frontend/src/components/LawInitializer.tsx",
          "operation": "create",
          "description": "Create a component that triggers law initialization on first app load. Use the useInitializeLaws hook and check if laws already exist using useAllLaws query. Display a subtle initialization status indicator during the process. Ensure this component runs once and doesn't reinitialize on subsequent visits. Style consistently with the burgundy/gold legal theme."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add the LawInitializer component to the application root, ensuring it runs before the main router content. Place it as a sibling to the RouterProvider so initialization happens on app mount. Maintain existing routing structure and Layout configuration."
        },
        {
          "path": "frontend/src/components/LawList.tsx",
          "operation": "modify",
          "description": "Verify the component correctly handles the expanded dataset of 50 laws. Ensure the scrollable list performs well with the larger dataset. Confirm the filtered law count displays accurately. No visual or functional changes needed if existing implementation already supports the data volume."
        },
        {
          "path": "frontend/src/components/LawListItem.tsx",
          "operation": "modify",
          "description": "Review text truncation for law titles and explanations to ensure they display correctly with potentially longer content from the 50 laws. Adjust truncation limits if necessary while maintaining the card layout and burgundy/gold styling."
        },
        {
          "path": "frontend/src/hooks/useLawFilter.ts",
          "operation": "modify",
          "description": "Verify the filtering logic performs efficiently with 50 laws. Ensure search matches work correctly across titles, numbers, and the comprehensive explanations. Optimize filtering algorithm if performance issues arise with the larger dataset."
        }
      ]
    }
  ]
}